# TITANIC COMPETITION

In [57]:
import pandas as pd

In [58]:
data_train = pd.read_csv("../datasets/train.csv")
data_test = pd.read_csv("../datasets/test.csv")
Submission = pd.read_csv("../datasets/gender_submission.csv")

In [59]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [60]:
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Elimino columnas

In [61]:
data_train.drop(['PassengerId', 'Name', 'Ticket', 'Fare', 'Cabin'],axis=1,inplace=True)
data_test.drop(['PassengerId', 'Name', 'Ticket', 'Fare', 'Cabin'],axis=1,inplace=True)

In [62]:
data_train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

### Tratamiento variables categoricas

In [63]:
data_train['Sex'].replace({'male': 1, 'female': 0}, inplace=True)
data_test['Sex'].replace({'male': 1, 'female': 0}, inplace=True)

In [64]:
data_train.replace({'S':1, 'C':2, 'Q':3}, inplace=True)
data_test.replace({'S':1, 'C':2, 'Q':3}, inplace=True)

In [65]:
data_train.tail()

     Survived  Pclass  Sex   Age  SibSp  Parch  Embarked
886         0       2    1  27.0      0      0       1.0
887         1       1    0  19.0      0      0       1.0
888         0       3    0   NaN      1      2       1.0
889         1       1    1  26.0      0      0       2.0
890         0       3    1  32.0      0      0       3.0

### Tratamiento de NaN

In [66]:
import random

In [67]:
data_train["Age"] = data_train["Age"].fillna(data_train["Age"].mean())
data_test["Age"] = data_test["Age"].fillna(data_test["Age"].mean())

In [68]:
data_train["Embarked"].value_counts()

1.0    644
2.0    168
3.0     77
Name: Embarked, dtype: int64

In [69]:
data_test["Embarked"].value_counts()

1    270
2    102
3     46
Name: Embarked, dtype: int64

In [70]:
#S:1, C:2, Q:3
embarked_pos = [1, 2, 3]

In [71]:
644+168+77

889

In [72]:
270+102+46

418

In [73]:
data_train["Embarked"] = data_train["Embarked"].fillna(random.choices(embarked_pos, weights=(644/889, 168/889, 77/889), k=1)[0])
data_test["Embarked"] = data_test["Embarked"].fillna(random.choices(embarked_pos, weights=(270/418, 102/418, 46/418), k=1)[0])

In [74]:
data_train.head()

   Survived  Pclass  Sex   Age  SibSp  Parch  Embarked
0         0       3    1  22.0      1      0       1.0
1         1       1    0  38.0      1      0       2.0
2         1       3    0  26.0      0      0       1.0
3         1       1    0  35.0      1      0       1.0
4         0       3    1  35.0      0      0       1.0

In [75]:
data_test.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  34.5      0      0         3
1       3    0  47.0      1      0         1
2       2    1  62.0      0      0         3
3       3    1  27.0      0      0         1
4       3    0  22.0      1      1         1

### Modelo

In [76]:
X = data_train.drop(["Survived"], axis=1)
Y = data_train["Survived"]

In [78]:
from sklearn.model_selection import train_test_split

In [93]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=46)

### Logistic Regression

In [94]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [95]:
lr = LogisticRegression()
lr.fit(X_train, Y_train)
pred = lr.predict(X_test)
acc = accuracy_score(pred, Y_test)
acc

0.8435754189944135

### Submission

In [96]:
pred_test = lr.predict(data_test)

In [97]:
sub = pd.DataFrame({"PassengerId": Submission["PassengerId"], "Survived": pred_test})

In [98]:
sub.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [99]:
sub.to_csv('submission.csv', index=False)

## Kaggle score: 0.77272